[
  {
    "path": "posts/2021-01-26-dataviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "This assignment sets to critically assess the data visualisation of Resident Labour by Age published by the Ministry of Manpower in the Labour Force in Singapore Advance Release 2019 report.",
    "author": [
      {
        "name": "Dylan Wong",
        "url": "https://www.linkedin.com/in/dylan-wong/"
      }
    ],
    "date": "2021-01-26",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nOverview\r\nA. Critiques\r\nClarity\r\nAesthetics\r\n\r\nB. Proposed alternative Data Visualisation\r\nC. Proposed Data Visualisation\r\nD. Step-by-step description of the Data Visualisation preparation\r\n1. Preparation of data source\r\n2. Reformat the data in sheet T7_T using Microsoft Excel\r\n3. Importing to Tableau\r\n4. Visualising using bar chart\r\n5. Creating data table\r\n6. Creating Dashboard\r\n\r\nE. Observations revealed by the Data Visualisation prepared\r\n\r\n\r\ntoc {\r\ntext-align: left\r\n}\r\nh1, h2, h3 {\r\ntext-align: left\r\n}\r\nbody {\r\ntext-align: justify}\r\nOverview\r\nAdopted from Labour Force in Singapore Advance Release 2019A. Critiques\r\nClarity\r\nThe details highlighted in the write-up is not visualised clearly on the chart. While readers could manually calculate the changes of the sum of the multiple age groups across the 2 years, it would be more intuitive if the charts could convey the message intended by the author.\r\nThe data table below the chart is useful in showing the difference in the percentages of resident labour force between the 2 years. However, just by looking at the line chart itself, readers would not be able to figure out the percentage value as the y-axis is not present.\r\nThe data points could not be identified easily, especially so for age 55-59 in 2009 and both age 55-59 and 60-64 in 2019 where the lines appears to be linear.\r\nAt the first glance of the chart and without reading into the details, readers may mistake the chart as depicting changes over time as that it the typical use of line chart.\r\nWhile “Per Cent” is the spelling in UK English, which is also the English system adopted by Singapore, “Percent” is more commonly used in Singapore educational system. Local readers may second guess on whether the term is referring to “per cent” in monetary term.\r\nThe title of the chart is clear but provides little details of what the chart is about.\r\nAesthetics\r\nThe colours of the data table matches that of the line chart. It helps readers to easily identify the corresponding line when they are referring to the data table.\r\nThe 2 colours choice is not ideal and it does not allow readers to immediately notice the differences especially when the report was published in low resolution.\r\nThere is no grid lines to guide the data points to the x-axis, requiring reader to put in more effort to mentally trace the data point to the corresponding age group.\r\nLine graphs are typically used to display data or information that changes over time continously or when trend needs to be observed. Since age groups are categorical, it would be more appropriate to for bar graphs or pie charts to be use especially since the data shown is in percentage.\r\nB. Proposed alternative Data Visualisation\r\nNo.\r\nCritiques (Clarity)\r\nSuggestions\r\n1\r\nThe details highlighted in the write-up is not visualised clearly on the chart. While readers could manually calculate the changes of the sum of the multiple age groups across the 2 years, it would be more intuitive if the charts could convey the message intended by the author.\r\nText could be added below the title to emphasise on the message the author is trying to convey\r\n2\r\nThe data table below the chart is useful in showing the difference in the percentages of resident labour force between the 2 years. However, just by looking at the line chart itself, readers would not be able to figure out the percentage value as the y-axis is not present.\r\nRetain the data table. Add the y-axis with grid lines to enable readers the option to read off the chart without having to refer to the table.\r\n3\r\nThe data points could not be identified easily, especially so for age 55-59 in 2009 and both age 55-59 and 60-64 in 2019 where the lines appears to be linear.\r\nEither have data points with size larger than the thickness of the lines, or change the chart type to a bar chart to better depict the percentage level\r\n4\r\nAt the first glance of the chart and without reading into the details, readers may mistake the chart as depicting changes over time as that it the typical use of line chart.\r\nSince age group is of categorical type, the use of bar charts will be more ideal.\r\n5\r\nWhile “Per Cent” is the spelling in UK English, which is also the English system adopted by Singapore, “Percent” is more commonly used in Singapore educational system. Local readers may second guess on whether the term is referring to “per cent” in monetary term.\r\nChange the unit title from “Per Cent” to “Percent”, and include the symbol “%” for make it more identifiable.\r\n6\r\nThe title of the chart is clear but provides little details of what the chart is about.\r\nImprove the title by changing it to “Comparison of the resident labour force participaton between 2009 and 2019 by age”.\r\nNo.\r\nCritiques (Aesthetics)\r\nSuggestions\r\n1\r\nThe colours of the data table matches that of the line chart. It helps readers to easily identify the corresponding line when they are referring to the data table.\r\nRetain the use of matching colours of chart and data table.\r\n2\r\nThe 2 colours are not very distinct. To make the matter worse, the background is of grey colour - same color but of different tone as 2009 line. It is a poor choice of colours especially when the report was published in low resolution.\r\nImprove the colour contrast by changing the colour from dark grey-blue to orange-blue, and use white background.\r\n3\r\nThere is no grid lines to guide the data points to the x-axis, requiring reader to put in more effort to mentally trace the data point to the corresponding age group.\r\nSince it is proposed that the chart type be changed to bar chart, there is no longer a need for vertical grid line or reference line. However, if line chart is to be use, grid lines should be added.\r\n4\r\nLine graphs are typically used to display data or information that changes over time continously or when trend needs to be observed. Since age groups are categorical, it would be more appropriate to for bar graphs or pie charts to be use especially since the data shown is in percentage.\r\nAs aforementioned, the chart type proposed is bar chart.\r\nC. Proposed Data Visualisation\r\n\r\nD. Step-by-step description of the Data Visualisation preparation\r\n1. Preparation of data source\r\nDownload the Excel data (7) Resident Labour Force Aged Fifteen Years and Over by Age and Sex, 2009 - 2019 (June) from MOM site.\r\n\r\n2. Reformat the data in sheet T7_T using Microsoft Excel\r\nSelect the entire sheet and Clear Formats\r\nDelete Rows 1 to 4, 6, and 19\r\nCut cell B1 and past in cell D1\r\nDelete Columns A to C and F to X\r\nInsert new columns at Column D and compute the percentage of total for each age group\r\nRename “Age (Years)” as “Age Group”, “2009” as “2009 Number”, “2019” as “2019 Number”, and the computed percentages as “2009” and “2019” respectively\r\nFind and replace the spacing in the data under Column A, and rename “70 & Over” as “>=70”\r\nFinally, remove the other sheets and save the file as “Cleaned Data.xlsx”\r\n\r\n3. Importing to Tableau\r\nOpen up Tableau and import Cleaned Data.xlsx\r\n\r\n4. Visualising using bar chart\r\nOn a new worksheet, drag and drop Age Group to Columns and 2009 and 2019 to Rows\r\n\r\nSelect side-by-side bars under Show Me\r\n\r\n\r\nTurn on Show Mark Labels to display the percentage value above each bar\r\nChange the number format of both measures 2009 and 2019 to percentage by right-clicking the measures, select Default Properties > Number Format > Percentage\r\n\r\n\r\nSimilarly, format the y-axis value to percentage by right-clicking the y-axis, Format > Scale > Numbers > Percentage\r\n\r\nSince the measure names are displayed as legend at the* side, there is no need to have “2009” and “2019” repeated across the a-xis. This could be removed by selecting the drop down at Measure Names and unchecking Show Header\r\n\r\nAs a final touch up on the bar chart, right-click on any part of the y-axis and select Edit Axis. Under Title, change the text from “Value” to “Percent (%)”\r\n\r\n5. Creating data table\r\nOn a new worksheet, drag and drop 2009 Number and 2019 Number to Rows, and Age Group to Columns. Next, select text tables under Show Me\r\n\r\nSwap Measure Names from Columns to Rows, and Age Group from Rows to Columns.\r\nAmend the header names by right-clicking on 2009 Number and 2019 Number, and change them to 2009 and 2019 respectively by selecting Edit Alias.\r\nselect Analytics on the side panel and click on Totals to compute the grand total of resident labour force in each year\r\n\r\nFinal step here is to hide away the title by right-clicking on the title and selecting Hide Title\r\n\r\n6. Creating Dashboard\r\nOn a new dashboard, drag and drop the Bar Chart into the centre area. Next, drag and drop the Data Table below the Bar Chart as shown\r\n\r\nAdjust the hide and width of the bar chart and data table so that the age groups of the table is aligned to the x-axis of the bar chart. Here, there is a need to fix the size of the dashboard as setting the size to Automatic will mess up the intended alignment between the bar chart and the data table.\r\nDouble-click on the title of the bar chart to amend the title, and include message that the author wants to convey\r\n\r\nFinally, include the necessary text and source by draging the Text object into the dashboard\r\nThe final dashboard is as shown below, and could be access via the link provided.\r\nhttps://public.tableau.com/profile/dylan7338#!/vizhome/DatavizMakeover1_16118012680840/Dashboard1\r\nE. Observations revealed by the Data Visualisation prepared\r\nFrom the data visualisation prepared, the following observation could be made:\r\nThe labour force participation rate in each age group aligns to the life milestones of general Singapore population.\r\nAge 15-19 has the lowest LFPR as most of the residents in this group are still schooling. The fact that there is a small number in this age group in the labour force could be due to the need to supplement household income, early drop out of school, or as part of vacation part-time work in June period.\r\nAt Age 20-24, Singaporeans typically either pursue further study or join the work force after completing their tertiary education. This explains the spike in the LFPR of age 25-29 as many graduate from the universities.\r\n\r\nThe difference between the LFPR of age 50-54 and age groups 55 and over is rather drastic. This could be due to the 2007 - 2008 Global Financial Crisis where many employees were retrenched. Retrenchment at the age above 50 poses difficulties to those seeking reemployment. This resulted in the significant lower LFPR of age 55 and over in 2009.\r\nThe increase in LFPR of age group 55 and over from 2009 to 2019 could also be attributed to the aging population issue that Singapore is facing. Other reasons for later retirement could be due to the rise in the cost of living.\r\nDistill is a publication format for scientific and technical writing, native to the web.\r\nLearn more about using Distill at https://rstudio.github.io/distill.\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-01-26-dataviz-makeover-1/./image/Tableau.png",
    "last_modified": "2021-02-19T00:40:51+08:00",
    "input_file": "dataviz-makeover-1.utf8.md",
    "preview_width": 1563,
    "preview_height": 1148
  },
  {
    "path": "posts/2021-01-10-my-first-post/",
    "title": "My First Post",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "Dylan Wong",
        "url": "https://www.linkedin.com/in/dylan-wong/"
      }
    ],
    "date": "2021-01-10",
    "categories": [],
    "contents": "\r\n1.0 Overview\r\nCorrelation coefficient is a popular statistic that use to measure the type and strength of the relationship between two variables. The values of a correlation coefficient ranges between -1.0 and 1.0. A correlation coefficient of 1 shows a perfect linear relationship between the two variables, while a -1.0 shows a perfect inverse relationship between the two variables. A correlation coeficient of 0.0 shows no linear relationship between the two variables.\r\nWhen multivariate data are used, the correlation coeficeints of the pair comparisons are displayed in a table form known as correlation matrix or scatterplot matrix.\r\nThere are three broad reasons for computing a correlation matrix.\r\nTo reveal the relationship between highdimensional variables pairwisely.\r\nTo input into other analyses. For example, people commonly use correlation matrixes as inputs for exploratory factor analysis, confirmatory factor analysis, structural equation models, and linear regression when excluding missing values pairwise.\r\nAs a diagnostic when checking other analyses. For example, with linear regression a high amount of correlations suggests that the linear regression’s estimates will be unreliable.\r\nWhen the data is large, both in terms of the number of observations and the number of variables, Corrgram tend to be used to visually explore and analyse the structure and the patterns of relations among variables. It is designed based on two main schemes:\r\nRendering the value of a correlation to depict its sign and magnitude, and\r\nReordering the variables in a correlation matrix so that “similar” variables are positioned adjacently, facilitating perception.\r\nIn this hands-on exercise, you will learn how to plot data visualisation for visualising correlation matrix with R. It consists of three main sections. First, you will learn how to create correlation matrix using pairs() of R Graphics. Next, you will learn how to plot corrgram using corrplot package of R Lastly, you will learn how to create an interactive correlation matrix using plotly R. .\r\n2.0 Installing and Launching R Packages\r\nBefore you get started, you are required:\r\nto start a new R project, and\r\nto create a new R Markdown document.\r\nNext, you will use the code chunk below to install and launch corrplot, ggpubr, plotly and tidyverse in RStudio.\r\n\r\n\r\npackages = c('ggpubr', 'tidyverse')\r\n\r\nfor(p in packages){library\r\n  if(!require(p, character.only = T)){\r\n    install.packages(p)\r\n  }\r\n  library(p, character.only = T)\r\n}\r\n\r\n\r\n\r\n3.0 Importing and Preparing The Data Set\r\nIn this hands-on exercise, the Wine Quality Data Set of UCI Machine Learning Repository will be used. The data set consists of 13 variables and 6497 observations. For the purpose of this exercise, we have combined the red wine and white wine data into one data file. It is called wine_quality and is in csv file format.\r\n3.1 Importing Data\r\nFirst, let us import the data into R by using read_csv() of readr package.\r\n\r\n\r\nwine <- read_csv(\"data/wine_quality.csv\")\r\n\r\n\r\n\r\nNotice that beside quality and type, the rest of the variables are numerical and continuous data type.\r\n4.0 Univariate EDA with Histogram\r\nIn the figure below, multiple histograms are plottted to reveal the distribution of the selected variables in the wine quality data sets.\r\n\r\n\r\n\r\nThe code chunks used to create the data visualisation consists of two main parts. First, we will create the individual histograms using the code chunk below.\r\n\r\n\r\nfa <- ggplot(data=wine, aes(x= `fixed acidity`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nva <- ggplot(data=wine, aes(x= `volatile acidity`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nca <- ggplot(data=wine, aes(x= `citric acid`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nrs <- ggplot(data=wine, aes(x= `residual sugar`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nch <- ggplot(data=wine, aes(x= `chlorides`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nfSO2 <- ggplot(data=wine, aes(x= `free sulfur dioxide`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\ntSO2 <- ggplot(data=wine, aes(x= `total sulfur dioxide`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\ndensity <- ggplot(data=wine, aes(x= density)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\npH <- ggplot(data=wine, aes(x= pH)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nsulphates <- ggplot(data=wine, aes(x= sulphates)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nalcohol <- ggplot(data=wine, aes(x= alcohol)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\n\r\n\r\n\r\nNext, the ggarrange function of ggpur package is used to group these histograms together.\r\n\r\n\r\nggarrange(fa, va, ca, rs, ch, fSO2, tSO2, density, pH, sulphates, alcohol, \r\n          ncol = 4, nrow = 3)\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-01-10-my-first-post/my-first-post_files/figure-html5/unnamed-chunk-3-1.png",
    "last_modified": "2021-01-11T00:28:41+08:00",
    "input_file": {},
    "preview_width": 2304,
    "preview_height": 1152
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to Dylan's DataViz Blog",
    "description": "Welcome to my new blog. I hope you enjoy \nreading what I have to say!",
    "author": [
      {
        "name": "Dylan Wong",
        "url": "https://www.linkedin.com/in/dylan-wong/"
      }
    ],
    "date": "2021-01-10",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-02-18T03:29:05+08:00",
    "input_file": {}
  }
]
