[
  {
    "path": "posts/2021-02-15-dataviz-makeover-2/",
    "title": "DataViz Makeover 2",
    "description": "A critique and proposed makeover of the data visualisation created by a research team to understand the willingness of the public on COVID-19 vaccination. The data used by the research team was obtained from Imperial College London YouGov Covid 19 Behaviour Tracker Data Hub hosted at Github (https://github.com/YouGov-Data/covid-19-tracker).",
    "author": [
      {
        "name": "Dylan Wong",
        "url": "https://www.linkedin.com/in/dylan-wong/"
      }
    ],
    "date": "2021-02-15",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nOverview\r\nA. Critiques\r\nClarity\r\nAesthetics\r\n\r\nB. Proposed Improvement and Data Visualisation\r\nClarity\r\nAesthetics\r\nProposed Data Visualisation\r\n\r\nC. Data Visualisation in Tableau\r\nD. Preparation of Data Visualisation\r\n1. Data Preparation\r\n2. Loading of Data\r\n3. Creating Diverging Stacked Bar Chart\r\n4. Creating Error Bar on Dot Plot Chart\r\n5. Creating the Dashboard\r\n\r\nE. Observations\r\n\r\n\r\ntoc {\r\ntext-align: left\r\n}\r\nh1, h2, h3 {\r\ntext-align: left\r\n}\r\nbody {\r\ntext-align: justify}\r\nOverview\r\n\r\nA. Critiques\r\nClarity\r\nThe title of the 100% stacked bar chart on the left is misleading as the visualisation does not show which country is more pro-vaccine clearly. Viewers may not be able to understand intuitively what the surveyees were agreeing or disagreeing to.\r\nWhile it is pleasant that the right bar chart has been sorted in descending order to allow better reading experience, the order of the countries on the y-axis of both bar charts are not synchronised - the chart on the left is sorted alphabetically. viewers may be confused as to why the 2 charts are placed side by side, and they may second-guess whether the author is trying to make some sort of comparison.\r\nThe right bar chart is essentially just the extraction of the percentage of “strongly agree”, which has already been shown in the 100% stacked bar chart on the left. To achieve the same intent, the left bar chart could have been sorted in descending order by the “Strongly agree”, and with the “Strongly agree” bars aligned to the left - against the y-axis. Viewers may be confused by the redundant chart created.\r\nThe rationale as to why the focus is only on those who strongly agreed is unclear. “Agree” is also a positive response to the willingness to get vaccinated.\r\nThe confidence interval, which is the margin of error that tells reader how much the survey results would be reflective of the view of the overall population, is missing. Viewers should be kept informed.\r\nThe legend shows only “strongly agree” and “strongly disagree”. It is up to viewers’ own interpretation of what the other 3 colours are referring to.\r\nThe Likert scale used is rather unconventional. The ratings/ score is usually assigned in a progressive manner, i.e. higher rating denotes better or more positive response than the preceding value. The case here is opposite where “1” is assigned to “Strongly Agree” and “5” being assigned to “Strongly Disagree”.\r\nAesthetics\r\nThe word “vaccine” on the title of the left bar chart is misspelt as “vacinne” - not what viewers would expect from the English standard of research scientists from Imperial College London.\r\nIt is not clear what the legend title “Vac 1” is referring to.\r\nThe numbers on the legend is redundant as what really matters is to explain what each bar colour represents.\r\nThe colour scheme used in the left bar chart helps viewers to easily identify the different segments in the stacked bar chart. However, the colour choice could be further improved. For example, red typically denotes negative sentiment while green for positive sentiment. Therefore, the use of red for “not sure” and green for “strongly disagree” is not ideal.\r\nWhile it is a commendable effort to zoom in on the “strongly agree” with the bar chart on the right to allow the viewers to understand the percentage of the survey population who strongly agree to vaccination, which explains the un-synchronised x-axis scale, it is unfortunate that the x-axis maximum bound ended abruptly at “60%”. As a result, viewers may not be able identify the percentage value for United Kingdom.\r\nNames of countries are proper nouns and so the first letter of the names of countries should always be capitalised.\r\nB. Proposed Improvement and Data Visualisation\r\nClarity\r\nThe chart title should be changed to better reflect the survey question asked. Since there are other questions asked to\r\nIf 2 charts of similar y-axis are to be placed side by side, the order of the countries should be synchronised.\r\nSince the bar chart on the right is essentially redundant, replace it with an error bar on dot plot chart to help viewers visualise the uncertainty.\r\nInclude the missing legend names for rating 2 to 4, i.e. 2 = Agree, 3 = Neutral, 4 = Disagree\r\nAesthetics\r\nVisualise the Likert scale survey using diverging stacked bar chart. It helps viewers to better visualise the sentiments or desires of the surveyees with a common vertical baseline.\r\nRecode the names of countries to capitalise the first letter.\r\nImprove the colour scheme to group similar responses together, e.g. different shade of the same colour for “Strongly Agree” and “Agree” to denote similar sentiment.\r\nRemove the legend title as the legend itself is self-explanatory.\r\nProposed Data Visualisation\r\n\r\nC. Data Visualisation in Tableau\r\nThe interactive dashboard created could be found here.\r\n\r\nD. Preparation of Data Visualisation\r\n1. Data Preparation\r\nThe data use for this visualisation was downloaded from Imperial College London YouGov Covid 19 Behaviour Tracker Data Hub hosted on Github.\r\n\r\nFrom the upload history of the repository, it was observed that the files were last updated at different period ranging from few hours ago to 5 months ago. Since the research is to focus on survey conducted in January 2021, files updated after and before January 2021 are excluded. The data of Australia, Canada, Denmark, France, Germany, Italy, Japan, Netherlands, Norway, Singapore, South Korea, Spain, Sweden, and United Kingdom were used for the visualisation.\r\nUsing Tableau Prep Builder, the australia.csv file was first dragged directly from the folder into the Tableau Prep Builder window.\r\n\r\nTo merge the data files of the other countries, make sure that the files are save in the same location as australia.csv. Thereafter, in Tableau Prep Builder, select the Multiple Files tab > Wildcard union > Apply\r\n\r\nFrom the right panel, it was observed that the data has many variables. Referring to the codebook.xlsx file, identify the variables to be retained and leave them checked. One could either first uncheck all fields then manually check the fields needed, or leave all fields checked and manually uncheck the fields not needed. For this visualisation exercise, the fields selected are: endtime, household_children, age, gender, household_size, employment_status, vac_1, vac2_1, vac2_2, vac2_3, vac2_6, vac_3, employment_status_1, employment_status_2, employment_status_3, employment_status_4, employment_status_5, employment_status_6, employment_status_7, File Paths.\r\n\r\nReferring to codebook.xlsx, the original field names are as follow:\r\nVariables\r\nOriginal Field Names\r\nendtime\r\nWhen did you complete this question (epoch seconds)?\r\nhousehold_children\r\nNumber of children under 18 in household\r\nage\r\nAge\r\ngender\r\nGender\r\nhousehold_size\r\nNumber of people in household\r\nemployment_status\r\nEmployment Status\r\nvac_1\r\nIf a Covid-19 vaccine were made available to me this week, I would definitely get it\r\nvac2_1\r\nI am worried about getting COVID19\r\nvac2_2\r\nI am worried about potential side effects of a COVID19 vaccine\r\nvac2_3\r\nI believe government health authorities in my country will provide me with an effective COVID19 vaccine\r\nvac2_6\r\nIf I do not get a COVID19 vaccine when it is available, I will regret it\r\nvac_3\r\nIf a Covid-19 vaccine becomes available to me a year from now, I definitely intend to get it\r\nemployment_status_1\r\nFull time employment\r\nemployment_status_2\r\nPart time employment\r\nemployment_status_3\r\nFull time student\r\nemployment_status_4\r\nRetired\r\nemployment_status_5\r\nUnemployed\r\nemployment_status_6\r\nNot working\r\nemployment_status_7\r\nOther\r\nFile Paths\r\nFile Name (Country)\r\n\r\nNext, click on the “+” sign beside connected data and add a Clean Step to apply the variables selection.\r\n\r\n\r\n\r\nUnder Clean 1 step, frequency distributions of each variables could be observed. To ensure that the eventual visualisation is limited to data collected in January 2021 only, the endtime was filtered by clicking on the 3 dots button “…” > Filter > Range of Dates\r\n\r\n\r\n\r\nThe minimum date was set at 01/01/2021. Since from the frequency distribution it was observed that there are no data collect beyond January 2021, a maximum date need not be inputted.\r\n\r\n\r\n\r\nIt was also observed that the datas sets from several countries have separate fields for respondents to respond to the question on their employment status, i.e. employment_status_1, employment_status_2, employment_status_3, employment_status_4, employment_status_5, employment_status_6, employment_status_7. A calculated field was created to harmonise these fields into one. After clicking on Create Calculated Field…, input the formula shown below to consolidate the different variables for employment status.\r\n\r\nFile Paths was renamed to Country\r\n\r\nFinally, export the data by creating an Output step. Click on the the “+” button beside Clean 1 and select Output.\r\n\r\n\r\n\r\nIn the Output, select the preferred savings option and click on Run Flow.\r\n\r\n\r\n\r\n2. Loading of Data\r\nOpen up Tableau, click on Text file and locate the Cleaned.csv file exported from Tableau Prep Builder\r\n\r\nMinor clean up here before the visualisation\r\nHide away unnecessary columns, i.e. employment_status_1, employment_status_2, employment_status_3, employment_status_4, employment_status_5, employment_status_6, employment_status_7\r\n\r\nRight-click on the Country column, and select Aliases...\r\n\r\nEdit the country names - removing “.cvs” and capitalising first letter\r\n\r\n3. Creating Diverging Stacked Bar Chart\r\nTo create the diverging stacked bar chart, the vaccine related survey questions, i.e. vac_1, vac2_1, vac2_2, vac2_3, vac2_6, vac_3, are pivoted. Highlight the columns, right-click, and select Pivot.\r\n\r\nNext, double-clock on the column names and change it to “Survey Questions” and “Score” as shown.\r\n\r\nRight-click on the Survey Questions column and select Aliases... Update the Value of the field names to the actual questions.\r\n\r\nSimilarly for Score, update the aliases.\r\n\r\nCreate a calculated field to assign an integer value to each score and name is “Response”.\r\n\r\nCreate 7 other calculated fields using the formula shown:\r\nFields\r\nFormula\r\nNumber of Records\r\n1\r\nTotal Count\r\nTotal(SUM([Number of Records]))\r\nCount Negative\r\nIF [Response]<3 THEN 1 ELSEIF [Response]=3 THEN 0.5 ELSE 0 END\r\nTotal Count Negative\r\nTOTAL(SUM([Count Negative]))\r\nPercentage\r\nSUM([Number of Records])/[Total Count]\r\nGantt Start\r\n-[Total Count Negative]/[Total Count]\r\nGantt Percent\r\nPREVIOUS_VALUE([Gantt Start])+ZN(LOOKUP([Percentage],-1))\r\n\r\nDrag Gantt Percent from the left panel into Columns Country into Rows, and Response into Detail\r\n\r\nFrom the dropdown menu of Gantt Percent, select Compute Using > Response\r\n\r\nNext, change the chart type to Gantt Chart, drag from the left panel Response into Color, and Percentage into Size\r\n\r\nDouble-click on the color palette on the top right corner, and adjust the color appropriately.\r\n\r\n\r\nDrag Survey Questions into Filter, select All, and follow by Apply.\r\n\r\nRight-click on Survey Questions under Filter, and select Show Filter.\r\n\r\nOn the right panel, click on the the dropdown arrow in the Survey Questions filter and select Single Value (dropdown).\r\n\r\nNext, to create the typical age groups used, right-click on Age on the left panel. Then, select the first age then hold down Shift key to select the last age of the age group to be created. Click on Group and input the name of the age group.\r\n\r\n\r\nSimilar groups are also created for Household Children and Household Size. Drag the newly created Household Children (group), Household Size (group), Age (group), along with Employment Status into the Filters. Right-click each of these variables in the Filters and select Show Filter\r\n\r\nSince Survey Questions filter options could not be displayed in full if display on the right due to the long text, it was dragged down to the under the graph. Using the similar method described above, the filter selection types of Household Children (group), Household Size (group), Age (group), Employment Status, and were changed to Single Value (dropdown).\r\nLast but not least, on the dropdown of Country field in Rows, and select Sort. Sort By Field in Ascending order, and select % Agree under Field Name.\r\n\r\n4. Creating Error Bar on Dot Plot Chart\r\nThe first step is to create calculated field as follows. Here both “Agree” and “Strongly Agree”, as well as 50% of “Neutral” are treated equally as “Agree”.\r\nField\r\nFormula\r\n% Agree%\r\nSUM(IF [Response]=5 OR [Response] = 4 THEN 1 ELSEIF [Response] = 3 THEN 0.5 ELSE 0 END)/ SUM([Number of Records])\r\nProp_SE\r\nSQRT(([% Agree]*(1-[% Agree]))/SUM([Number of Records]))\r\nZ_95%\r\n1.959964\r\nZ_99%\r\n2.575829\r\nProp_Margin of Error 95%\r\n[Z_95%]*[Prop_SE]\r\nProp_Lower Limit 95%\r\n[% Agree]-[Prop_Margin of Error 95%]\r\nProp_Upper Limit 95%\r\n[% Agree]+[Prop_Margin of Error 95%]\r\nProp_Margin of Error 99%\r\n[Z_99%]*[Prop_SE]\r\nProp_Lower Limit 99%\r\n[% Agree]-[Prop_Margin of Error 99%]\r\nProp_Upper Limit 99%\r\n[% Agree]+[Prop_Margin of Error 99%]\r\n\r\nTo create the chart, % Agree was first dragged into Columns from the left panel and Country into Rows\r\nNext, create a new parameter with the inputs shown below\r\n\r\nMeasure Values was then dragged into Columns. Click on the dropdown of Measure Values and select Dual Axis.\r\n\r\nHold down the Ctrl key on the keyboard and select all the fields to be removed from the Measure Values pane. Then drag the highlighted fields out of the pane.\r\n\r\nRight-click on the x-axis and select Synchronise Axis\r\n\r\nUnder the Measure Values setting, change the visualisation type to Line. Drag Measure Names into Path, and another Measure Names from the left panel to Colour\r\n\r\nRight-click on the Confidence Interval parameter created and select show Parameter.\r\n\r\nChange the colour of the Lower Limit and Upper Limit to grey, and swap the position of Measure Values and % Agree in the Columns.\r\n\r\nLastly, on the dropdown of Country field in Rows, and select Sort. Sort By Field in Ascending order, and select % Agree under Field Name.\r\n\r\n5. Creating the Dashboard\r\nIn a new dashboard, drag the “Diverging” worksheet into the center. Next, drag the “CI” worksheet onto the right side of the diverging stacked bar chart.\r\n\r\nArrange the Filters and Legend neatly as shown. Since there is sufficient space, the selection type for Employment Status filter was changed to Multiple Values (list).\r\n\r\nSince the options of Survey Questions filters are truncated if placed on the side along with the other filters due to the long text, it was dragged to the bottom of the 2 graph.\r\n\r\nInsert Text on top of the 2 charts to create a chart title\r\n\r\nFinally, right-click on the Household Children (group), Household Size (group), Age (group), Employment Status, and Survey Questions filters > Apply to Worksheets > All Using Related Data Sources to synchronise the filters for both charts. This has to be done individually and manually for all filters mentioned.\r\n\r\nE. Observations\r\n\r\nFrom the comparison of the 2 survey responses above, i.e. “If a Covid-19 vaccine were made available to me this week, I would definitely get it” and “I am worried about getting COVID19”, it could be observed that a number of countries are in dilemma. For example, while Japan worries the most about contracting COVID-19, they are also worried about getting vaccinated in both near and far future. In fact, they are extremely worried of the potential side effect of the vaccine that and the trust in government as shown. This is rather surprising as Japan was never known to be more “kiasi” or worrisome than Singapore, but from the data it is clear that Japan is the worst. Not only are they afraid of COVID-19, they are also afraid of being affected by the potential side effects to the point that they will not consider getting vaccinated 1 year later. Another country with such observation is France. It is a relief that while Singaporeans are afraid of COVID-19 and the vaccine, at least they have a government that they trust (backed by data).\r\n\r\nIt could be observed that United Kingdom, Denmark, and Israel are very enthusiastic about getting vaccinated. This is due to the fact that they have government who they trust\r\n\r\nGlobally, there are less margin error in the responses of those who are full time employed and retired for all questions. The margin of error observed on those who are not working, unemployed, and part time employed are wide. This shows the respondents who are working or have worked are mostly consistent in their responses and their responses are much more representative of the real population.\r\nDistill is a publication format for scientific and technical writing, native to the web.\r\nLearn more about using Distill at https://rstudio.github.io/distill.\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-02-15-dataviz-makeover-2/./image/Tableau.png",
    "last_modified": "2021-02-26T19:33:20+08:00",
    "input_file": {},
    "preview_width": 2552,
    "preview_height": 1393
  },
  {
    "path": "posts/2021-01-26-dataviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "This assignment sets to critically assess the data visualisation of Resident Labour by Age published by the Ministry of Manpower in the Labour Force in Singapore Advance Release 2019 report.",
    "author": [
      {
        "name": "Dylan Wong",
        "url": "https://www.linkedin.com/in/dylan-wong/"
      }
    ],
    "date": "2021-01-26",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nOverview\r\nA. Critiques\r\nClarity\r\nAesthetics\r\n\r\nB. Proposed alternative Data Visualisation\r\nC. Proposed Data Visualisation\r\nD. Step-by-step description of the Data Visualisation preparation\r\n1. Preparation of data source\r\n2. Reformat the data in sheet T7_T using Microsoft Excel\r\n3. Importing to Tableau\r\n4. Visualising using bar chart\r\n5. Creating data table\r\n6. Creating Dashboard\r\n\r\nE. Observations revealed by the Data Visualisation prepared\r\n\r\n\r\ntoc {\r\ntext-align: left\r\n}\r\nh1, h2, h3 {\r\ntext-align: left\r\n}\r\nbody {\r\ntext-align: justify}\r\nOverview\r\nAdopted from Labour Force in Singapore Advance Release 2019A. Critiques\r\nClarity\r\nThe details highlighted in the write-up is not visualised clearly on the chart. While readers could manually calculate the changes of the sum of the multiple age groups across the 2 years, it would be more intuitive if the charts could convey the message intended by the author.\r\nThe data table below the chart is useful in showing the difference in the percentages of resident labour force between the 2 years. However, just by looking at the line chart itself, readers would not be able to figure out the percentage value as the y-axis is not present.\r\nThe data points could not be identified easily, especially so for age 55-59 in 2009 and both age 55-59 and 60-64 in 2019 where the lines appears to be linear.\r\nAt the first glance of the chart and without reading into the details, readers may mistake the chart as depicting changes over time as that it the typical use of line chart.\r\nWhile “Per Cent” is the spelling in UK English, which is also the English system adopted by Singapore, “Percent” is more commonly used in Singapore educational system. Local readers may second guess on whether the term is referring to “per cent” in monetary term.\r\nThe title of the chart is clear but provides little details of what the chart is about.\r\nAesthetics\r\nThe colours of the data table matches that of the line chart. It helps readers to easily identify the corresponding line when they are referring to the data table.\r\nThe 2 colours choice is not ideal and it does not allow readers to immediately notice the differences especially when the report was published in low resolution.\r\nThere is no grid lines to guide the data points to the x-axis, requiring reader to put in more effort to mentally trace the data point to the corresponding age group.\r\nLine graphs are typically used to display data or information that changes over time continously or when trend needs to be observed. Since age groups are categorical, it would be more appropriate to for bar graphs or pie charts to be use especially since the data shown is in percentage.\r\nB. Proposed alternative Data Visualisation\r\nNo.\r\nCritiques (Clarity)\r\nSuggestions\r\n1\r\nThe details highlighted in the write-up is not visualised clearly on the chart. While readers could manually calculate the changes of the sum of the multiple age groups across the 2 years, it would be more intuitive if the charts could convey the message intended by the author.\r\nText could be added below the title to emphasise on the message the author is trying to convey\r\n2\r\nThe data table below the chart is useful in showing the difference in the percentages of resident labour force between the 2 years. However, just by looking at the line chart itself, readers would not be able to figure out the percentage value as the y-axis is not present.\r\nRetain the data table. Add the y-axis with grid lines to enable readers the option to read off the chart without having to refer to the table.\r\n3\r\nThe data points could not be identified easily, especially so for age 55-59 in 2009 and both age 55-59 and 60-64 in 2019 where the lines appears to be linear.\r\nEither have data points with size larger than the thickness of the lines, or change the chart type to a bar chart to better depict the percentage level\r\n4\r\nAt the first glance of the chart and without reading into the details, readers may mistake the chart as depicting changes over time as that it the typical use of line chart.\r\nSince age group is of categorical type, the use of bar charts will be more ideal.\r\n5\r\nWhile “Per Cent” is the spelling in UK English, which is also the English system adopted by Singapore, “Percent” is more commonly used in Singapore educational system. Local readers may second guess on whether the term is referring to “per cent” in monetary term.\r\nChange the unit title from “Per Cent” to “Percent”, and include the symbol “%” for make it more identifiable.\r\n6\r\nThe title of the chart is clear but provides little details of what the chart is about.\r\nImprove the title by changing it to “Comparison of the resident labour force participaton between 2009 and 2019 by age”.\r\nNo.\r\nCritiques (Aesthetics)\r\nSuggestions\r\n1\r\nThe colours of the data table matches that of the line chart. It helps readers to easily identify the corresponding line when they are referring to the data table.\r\nRetain the use of matching colours of chart and data table.\r\n2\r\nThe 2 colours are not very distinct. To make the matter worse, the background is of grey colour - same color but of different tone as 2009 line. It is a poor choice of colours especially when the report was published in low resolution.\r\nImprove the colour contrast by changing the colour from dark grey-blue to orange-blue, and use white background.\r\n3\r\nThere is no grid lines to guide the data points to the x-axis, requiring reader to put in more effort to mentally trace the data point to the corresponding age group.\r\nSince it is proposed that the chart type be changed to bar chart, there is no longer a need for vertical grid line or reference line. However, if line chart is to be use, grid lines should be added.\r\n4\r\nLine graphs are typically used to display data or information that changes over time continously or when trend needs to be observed. Since age groups are categorical, it would be more appropriate to for bar graphs or pie charts to be use especially since the data shown is in percentage.\r\nAs aforementioned, the chart type proposed is bar chart.\r\nC. Proposed Data Visualisation\r\n\r\nD. Step-by-step description of the Data Visualisation preparation\r\n1. Preparation of data source\r\nDownload the Excel data (7) Resident Labour Force Aged Fifteen Years and Over by Age and Sex, 2009 - 2019 (June) from MOM site.\r\n\r\n2. Reformat the data in sheet T7_T using Microsoft Excel\r\nSelect the entire sheet and Clear Formats\r\nDelete Rows 1 to 4, 6, and 19\r\nCut cell B1 and past in cell D1\r\nDelete Columns A to C and F to X\r\nInsert new columns at Column D and compute the percentage of total for each age group\r\nRename “Age (Years)” as “Age Group”, “2009” as “2009 Number”, “2019” as “2019 Number”, and the computed percentages as “2009” and “2019” respectively\r\nFind and replace the spacing in the data under Column A, and rename “70 & Over” as “>=70”\r\nFinally, remove the other sheets and save the file as “Cleaned Data.xlsx”\r\n\r\n3. Importing to Tableau\r\nOpen up Tableau and import Cleaned Data.xlsx\r\n\r\n4. Visualising using bar chart\r\nOn a new worksheet, drag and drop Age Group to Columns and 2009 and 2019 to Rows\r\n\r\nSelect side-by-side bars under Show Me\r\n\r\n\r\nTurn on Show Mark Labels to display the percentage value above each bar\r\nChange the number format of both measures 2009 and 2019 to percentage by right-clicking the measures, select Default Properties > Number Format > Percentage\r\n\r\n\r\nSimilarly, format the y-axis value to percentage by right-clicking the y-axis, Format > Scale > Numbers > Percentage\r\n\r\nSince the measure names are displayed as legend at the* side, there is no need to have “2009” and “2019” repeated across the a-xis. This could be removed by selecting the drop down at Measure Names and unchecking Show Header\r\n\r\nAs a final touch up on the bar chart, right-click on any part of the y-axis and select Edit Axis. Under Title, change the text from “Value” to “Percent (%)”\r\n\r\n5. Creating data table\r\nOn a new worksheet, drag and drop 2009 Number and 2019 Number to Rows, and Age Group to Columns. Next, select text tables under Show Me\r\n\r\nSwap Measure Names from Columns to Rows, and Age Group from Rows to Columns.\r\nAmend the header names by right-clicking on 2009 Number and 2019 Number, and change them to 2009 and 2019 respectively by selecting Edit Alias.\r\nselect Analytics on the side panel and click on Totals to compute the grand total of resident labour force in each year\r\n\r\nFinal step here is to hide away the title by right-clicking on the title and selecting Hide Title\r\n\r\n6. Creating Dashboard\r\nOn a new dashboard, drag and drop the Bar Chart into the centre area. Next, drag and drop the Data Table below the Bar Chart as shown\r\n\r\nAdjust the hide and width of the bar chart and data table so that the age groups of the table is aligned to the x-axis of the bar chart. Here, there is a need to fix the size of the dashboard as setting the size to Automatic will mess up the intended alignment between the bar chart and the data table.\r\nDouble-click on the title of the bar chart to amend the title, and include message that the author wants to convey\r\n\r\nFinally, include the necessary text and source by draging the Text object into the dashboard\r\nThe final dashboard is as shown below, and could be access via the link provided.\r\nhttps://public.tableau.com/profile/dylan7338#!/vizhome/DatavizMakeover1_16118012680840/Dashboard1\r\nE. Observations revealed by the Data Visualisation prepared\r\nFrom the data visualisation prepared, the following observation could be made:\r\nThe labour force participation rate in each age group aligns to the life milestones of general Singapore population.\r\nAge 15-19 has the lowest LFPR as most of the residents in this group are still schooling. The fact that there is a small number in this age group in the labour force could be due to the need to supplement household income, early drop out of school, or as part of vacation part-time work in June period.\r\nAt Age 20-24, Singaporeans typically either pursue further study or join the work force after completing their tertiary education. This explains the spike in the LFPR of age 25-29 as many graduate from the universities.\r\n\r\nThe difference between the LFPR of age 50-54 and age groups 55 and over is rather drastic. This could be due to the 2007 - 2008 Global Financial Crisis where many employees were retrenched. Retrenchment at the age above 50 poses difficulties to those seeking reemployment. This resulted in the significant lower LFPR of age 55 and over in 2009.\r\nThe increase in LFPR of age group 55 and over from 2009 to 2019 could also be attributed to the aging population issue that Singapore is facing. Other reasons for later retirement could be due to the rise in the cost of living.\r\nDistill is a publication format for scientific and technical writing, native to the web.\r\nLearn more about using Distill at https://rstudio.github.io/distill.\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-01-26-dataviz-makeover-1/./image/Tableau.png",
    "last_modified": "2021-02-19T00:40:52+08:00",
    "input_file": {},
    "preview_width": 1563,
    "preview_height": 1148
  },
  {
    "path": "posts/2021-01-10-my-first-post/",
    "title": "My First Post",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "Dylan Wong",
        "url": "https://www.linkedin.com/in/dylan-wong/"
      }
    ],
    "date": "2021-01-10",
    "categories": [],
    "contents": "\r\n1.0 Overview\r\nCorrelation coefficient is a popular statistic that use to measure the type and strength of the relationship between two variables. The values of a correlation coefficient ranges between -1.0 and 1.0. A correlation coefficient of 1 shows a perfect linear relationship between the two variables, while a -1.0 shows a perfect inverse relationship between the two variables. A correlation coeficient of 0.0 shows no linear relationship between the two variables.\r\nWhen multivariate data are used, the correlation coeficeints of the pair comparisons are displayed in a table form known as correlation matrix or scatterplot matrix.\r\nThere are three broad reasons for computing a correlation matrix.\r\nTo reveal the relationship between highdimensional variables pairwisely.\r\nTo input into other analyses. For example, people commonly use correlation matrixes as inputs for exploratory factor analysis, confirmatory factor analysis, structural equation models, and linear regression when excluding missing values pairwise.\r\nAs a diagnostic when checking other analyses. For example, with linear regression a high amount of correlations suggests that the linear regression’s estimates will be unreliable.\r\nWhen the data is large, both in terms of the number of observations and the number of variables, Corrgram tend to be used to visually explore and analyse the structure and the patterns of relations among variables. It is designed based on two main schemes:\r\nRendering the value of a correlation to depict its sign and magnitude, and\r\nReordering the variables in a correlation matrix so that “similar” variables are positioned adjacently, facilitating perception.\r\nIn this hands-on exercise, you will learn how to plot data visualisation for visualising correlation matrix with R. It consists of three main sections. First, you will learn how to create correlation matrix using pairs() of R Graphics. Next, you will learn how to plot corrgram using corrplot package of R Lastly, you will learn how to create an interactive correlation matrix using plotly R. .\r\n2.0 Installing and Launching R Packages\r\nBefore you get started, you are required:\r\nto start a new R project, and\r\nto create a new R Markdown document.\r\nNext, you will use the code chunk below to install and launch corrplot, ggpubr, plotly and tidyverse in RStudio.\r\n\r\n\r\npackages = c('ggpubr', 'tidyverse')\r\n\r\nfor(p in packages){library\r\n  if(!require(p, character.only = T)){\r\n    install.packages(p)\r\n  }\r\n  library(p, character.only = T)\r\n}\r\n\r\n\r\n\r\n3.0 Importing and Preparing The Data Set\r\nIn this hands-on exercise, the Wine Quality Data Set of UCI Machine Learning Repository will be used. The data set consists of 13 variables and 6497 observations. For the purpose of this exercise, we have combined the red wine and white wine data into one data file. It is called wine_quality and is in csv file format.\r\n3.1 Importing Data\r\nFirst, let us import the data into R by using read_csv() of readr package.\r\n\r\n\r\nwine <- read_csv(\"data/wine_quality.csv\")\r\n\r\n\r\n\r\nNotice that beside quality and type, the rest of the variables are numerical and continuous data type.\r\n4.0 Univariate EDA with Histogram\r\nIn the figure below, multiple histograms are plottted to reveal the distribution of the selected variables in the wine quality data sets.\r\n\r\n\r\n\r\nThe code chunks used to create the data visualisation consists of two main parts. First, we will create the individual histograms using the code chunk below.\r\n\r\n\r\nfa <- ggplot(data=wine, aes(x= `fixed acidity`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nva <- ggplot(data=wine, aes(x= `volatile acidity`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nca <- ggplot(data=wine, aes(x= `citric acid`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nrs <- ggplot(data=wine, aes(x= `residual sugar`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nch <- ggplot(data=wine, aes(x= `chlorides`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nfSO2 <- ggplot(data=wine, aes(x= `free sulfur dioxide`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\ntSO2 <- ggplot(data=wine, aes(x= `total sulfur dioxide`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\ndensity <- ggplot(data=wine, aes(x= density)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\npH <- ggplot(data=wine, aes(x= pH)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nsulphates <- ggplot(data=wine, aes(x= sulphates)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nalcohol <- ggplot(data=wine, aes(x= alcohol)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\n\r\n\r\n\r\nNext, the ggarrange function of ggpur package is used to group these histograms together.\r\n\r\n\r\nggarrange(fa, va, ca, rs, ch, fSO2, tSO2, density, pH, sulphates, alcohol, \r\n          ncol = 4, nrow = 3)\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-01-10-my-first-post/my-first-post_files/figure-html5/unnamed-chunk-3-1.png",
    "last_modified": "2021-01-11T00:28:41+08:00",
    "input_file": {},
    "preview_width": 2304,
    "preview_height": 1152
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to Dylan's DataViz Blog",
    "description": "Welcome to my new blog. I hope you enjoy \nreading what I have to say!",
    "author": [
      {
        "name": "Dylan Wong",
        "url": "https://www.linkedin.com/in/dylan-wong/"
      }
    ],
    "date": "2021-01-10",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-02-18T03:29:05+08:00",
    "input_file": {}
  }
]
